#3 задание
# На языке Python предложить алгоритм,
# который быстрее всего (по процессорным тикам) отсортирует данный ей массив чисел.
# Массив может быть любого размера со случайным порядком чисел (в том числе и отсортированным).
# Объяснить, почему вы считаете, что функция соответствует заданным критериям.


#Ответ на 3 задание
#Выбор сортировки зависит от поставленной задачи, некоторые виды сортировок решают специфические проблемы,
# при выборе нам надо учитывать легко ли разработчику реализовать сортировку,
# насколько элементы уже отсортированы, какие значения (случайные или не случайные) и т.д,
# для параметров О большого можно обратиться к таблице сортировок(добавила картинку)
#Я бы рекомендовала использовать быструю сортировку или сортировку слиянием